tutorials/incompressible/simpleWindFoam/turbineSiting/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 581321  4.78537e+06   930)
    ( 582290  4.78537e+06   930)
    ( 582290  4.78624e+06   930)
    ( 581321  4.78624e+06   930)
    ( 581321  4.78537e+06   1500)
    ( 582290  4.78537e+06   1500)
    ( 582290  4.78624e+06   1500)
    ( 581321  4.78624e+06   1500)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 20) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch outlet
    (
        (2 6 5 1)
    )
    patch sides
    (
        (1 5 4 0)
        (3 7 6 2)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    wall ground
    (
        (0 3 2 1)
    )
    patch top
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
